# SwitchToRasterProcessingInsteadOfVectorWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ExportFailures..::..SwitchToRasterProcessingInsteadOfVectorWarning Property
BuiltInFailures..::..ExportFailures Class See Also
---
Some of the views have been switched to raster processing though vector processing is selected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SwitchToRasterProcessingInsteadOfVectorWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SwitchToRasterProcessingInsteadOfVectorWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SwitchToRasterProcessingInsteadOfVectorWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ExportFailures Class
Autodesk.Revit.DB Namespace